In [1]:
import pandas as pd
import numpy as np

In [3]:
jam = pd.Series([50,250,450], index=['a', 'b', 'c'])
ade = pd.Series([200,400,600,800], index=['a', 'b', 'c', 'd'])

In [4]:
#add 2 series
jam + ade
# the reason why we got the NAN at index 'd' was bcos the value was not knw
#at jam series and if we add the value that is known plus the one that isnt we get NAN

a     250.0
b     650.0
c    1050.0
d       NaN
dtype: float64

In [11]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b','c'], index=['car','bike', 'tricycle'])
print(df1)

          a  b  c
car       0  1  2
bike      3  4  5
tricycle  6  7  8

In [12]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'], index=['car','bike', 'tricycle'])
print(df2)

          a  b   c   d
car       0  1   2   3
bike      4  5   6   7
tricycle  8  9  10  11

In [13]:
#add 2 dataframes
df1 + df2

           a   b   c   d
car        0   2   4 NaN
bike       7   9  11 NaN
tricycle  14  16  18 NaN

In [14]:
#use add() function
df1 = df1.add(df2, fill_value=0)
print(df1)

           a   b   c     d
car        0   2   4   3.0
bike       7   9  11   7.0
tricycle  14  16  18  11.0

In [15]:
#subtract a series from a dataframe
series_a = df2.loc['car']
print(series_a)

a    0
b    1
c    2
d    3
Name: car, dtype: int32

In [16]:
df2 - series_a

          a  b  c  d
car       0  0  0  0
bike      4  4  4  4
tricycle  8  8  8  8